<a href="https://colab.research.google.com/github/devindianushika/data_analysis1/blob/master/dataCleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Data Cleaning

In [67]:
import pandas as pd

load data file

In [68]:
df = pd.read_csv("test_with_col.csv")

In [69]:
df.head()

      name age index_num    title
0  devindi  25    174057  gtghyyy
1  hashini  24    174073  fmgjukl
2   saduni  24    174071   kliopy
3  rajitha  23    174047   fgtyui
4    kamal  22    174051   hjukio

In [70]:
df.tail()

      name age index_num   title
2   saduni  24    174071  kliopy
3  rajitha  23    174047  fgtyui
4    kamal  22    174051  hjukio
5    dasun   ?    175421       ?
6     john  45         ?       ?

identify missing values

In [71]:
import numpy as np
#replace ? with Nan
df.replace("?", np.nan, inplace= True)

In [72]:
df.head()

      name age index_num    title
0  devindi  25    174057  gtghyyy
1  hashini  24    174073  fmgjukl
2   saduni  24    174071   kliopy
3  rajitha  23    174047   fgtyui
4    kamal  22    174051   hjukio

In [73]:
df.tail()

      name  age index_num   title
2   saduni   24    174071  kliopy
3  rajitha   23    174047  fgtyui
4    kamal   22    174051  hjukio
5    dasun  NaN    175421     NaN
6     john   45       NaN     NaN

In [74]:
df.isnull().sum()

name         0
age          1
index_num    1
title        2
dtype: int64

In [75]:
df.dtypes

name         object
age          object
index_num    object
title        object
dtype: object

In [18]:
#remove Nan values from the table
#df = df.dropna(subset=['age'])

In [76]:
#convert age data type to integer
#get average of age
ave_age = df["age"].astype("float").mean()

In [77]:
print("avearge of age",ave_age)

avearge of age 27.166666666666668

In [78]:
#replace Nan values from mean value
df["age"].replace(np.nan, ave_age, inplace= True)

In [39]:
df.tail()

      name      age index_num   title
2   saduni       24    174071  kliopy
3  rajitha       23    174047  fgtyui
4    kamal       22    174051  hjukio
5    dasun  27.1667    175421     NaN
6     john       45       NaN     NaN

In [79]:
#same for index and title column
df["title"].replace(np.nan,"test",inplace = True)

In [80]:
#remove Nan values from the indexnum column
#axes=0 mean drop rawa which have nan valuea
#axes=1 mean drop whole column
df.dropna(subset=['index_num'],axis=0,inplace=True)

In [81]:
#df.reset_index(drop=True,inplace =True)
df.reset_index(drop=True, inplace=True)

In [82]:
df.head()

      name age index_num    title
0  devindi  25    174057  gtghyyy
1  hashini  24    174073  fmgjukl
2   saduni  24    174071   kliopy
3  rajitha  23    174047   fgtyui
4    kamal  22    174051   hjukio

In [83]:
df.tail()

      name      age index_num    title
1  hashini       24    174073  fmgjukl
2   saduni       24    174071   kliopy
3  rajitha       23    174047   fgtyui
4    kamal       22    174051   hjukio
5    dasun  27.1667    175421     test

In [84]:
df.dtypes

name         object
age          object
index_num    object
title        object
dtype: object

In [86]:
df[["age","index_num"]] = df[["age","index_num"]].astype("int")

In [87]:
df.dtypes

name         object
age           int64
index_num     int64
title        object
dtype: object

In [88]:
df.head()

      name  age  index_num    title
0  devindi   25     174057  gtghyyy
1  hashini   24     174073  fmgjukl
2   saduni   24     174071   kliopy
3  rajitha   23     174047   fgtyui
4    kamal   22     174051   hjukio

In [89]:
df.tail()

      name  age  index_num    title
1  hashini   24     174073  fmgjukl
2   saduni   24     174071   kliopy
3  rajitha   23     174047   fgtyui
4    kamal   22     174051   hjukio
5    dasun   27     175421     test